//напиши скрипт обработки покупки в магазине.
//баланс пользователя хранится в переменной balance
//сумма покупки хранится в переменной payment

//перед проверкой вывести сообщение 
//"общая стоимость заказа [число] кредитов. Проверяем кол-во доступных средств на счету" 

//если сумма покупки не превышает баланс:
// -вычесть из баланса сумму покупки 
// - вывести сообщение "На счету осталось [число] кредитов"
// если сумма покупки превышает баланс:
//-Вывести сообщение:"На счету недостаточно средств для совершения операции!"
//в конце вывести сообщение: "Операция завершена"

